<template>
    <section className="main__about-project" id="about-project">
        <h2 className="main__section-title">Опыт работы</h2>
        <ul className="main__about-project-list">
            <li className="main__about-project-item">
                <h3 className="main__about-project-item-title">Преподавательская деятельность</h3>
                <p className="main__about-project-item-description">
                    
                    Преподаватель робототехники в Компьютерной Академии Шаг: 
                    В течение 4 месяцев занимался преподаванием основ робототехники и 
                    программирования на примере конструкторов Lego WEDO 2.0 и Lego Mindstorms 
                    для детей в возрасте от 7 до 9 лет. Вместе с учениками изучали основы программирования 
                    и робототехники, развивали их навыки творческого мышления и пробуждали интерес 
                    к техническим наукам.
                <br><br>
                    Учитель информатики в МОУ СОШ №27 г. Екатеринбург: В течение 1 года и 1 месяца занимался 
                    преподаванием информатики ученикам 9-х классов. Моя работа включала обучение базовым программам, 
                    подготовку к ОГЭ по информатике и проверку заданий по ОГЭ. Старался создавать интересные и понятные 
                    уроки, помогая ученикам улучшать свои навыки в области информационных технологий.
                <br><br>
                    Преподаватель информатики в Образовательном центре ПНТЗ: В течение 1 года и 3 месяцев преподавал 
                    вычислительную технику и компьютерную графику студентам очного и заочного отделения. Моя задача 
                    заключалась в передаче знаний и навыков в области информатики, а также помощи студентам в освоении 
                    технологических требований.
                <br><br>
                    Вся моя работа в образовании направлена на развитие учеников и студентов в области информационных 
                    технологий и программирования. Я стремлюсь создавать интересные и понятные уроки, в которых каждый 
                    сможет улучшить свои навыки и достичь успеха в данной области.
                </p>
            </li>
            <li className="main__about-project-item">
                <h3 className="main__about-project-item-title">Коммерческая разработка</h3>
                <p className="main__about-project-item-description">
                    У меня богатый опыт работы в области разработки программного обеспечения. Последние несколько месяцев 
                    я работаю в компании Сайтсофт в должности программиста-разработчика. Мои обязанности включают
                    рефакторинг кода на PHP 7.4 и 8, использование фреймворков Kohana и Laravel, а также поддержку 
                    проектов с высоким объемом данных. Я также занимаюсь оптимизацией SQL запросов и рефакторингом кода на JQuery.
                    <br><br>
                    В течение некоторого времени я также работал в интернет-магазине ООО "ТРЦ в Кармане" в качестве 
                    программиста. Мои обязанности включали разработку нового функционала для административной части 
                    маркетплейса с использованием PHP 8.0 Laravel 8 и Vue.js 3.
                    <br><br>
                    До этого я занимал должность технического директора в компании ООО ИнЦентр. В рамках этой роли 
                    я занимался разработкой и поддержкой ERP системы для руководства монтажными бригадами, внедрением 
                    CRM системы, автоматизацией отдела продаж и разработкой технически сложных проектов.
                    <br><br>
                    Я также имею опыт работы в студии Спичка, где занимался разработкой сайтов и интеграцией 
                    различных компонентов на CMS 1С-Битрикс.</p>
            </li>
        </ul>
        <ul className="main__about-project-timeline">
            <li className="main__about-project-timeline-item">
                <h3 className="main__about-project-timeline-item-title main__about-project-timeline-item-title_black">2
                    года 8 месяцев</h3>
                <p className="main__about-project-timeline-item-description">Преподавание</p>
            </li>
            <li className="main__about-project-timeline-item">
                <h3 className="main__about-project-timeline-item-title main__about-project-timeline-item-title_gray">1
                    год 6 месяцев</h3>
                <p className="main__about-project-timeline-item-description">Веб-разработка</p>
            </li>
        </ul>
    </section>
</template>
<style scoped>
@import url('./AboutProject.css');
</style>